spec/support/vcr_cassettes/mvi/find_candidate/invalid_icn.yml

---
http_interactions:
- request:
    method: post
    uri: "<MVI_URL>"
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        CjxlbnY6RW52ZWxvcGUgeG1sbnM6c29hcGVuYz0iaHR0cDovL3NjaGVtYXMu
        eG1sc29hcC5vcmcvc29hcC9lbmNvZGluZy8iIHhtbG5zOnhzZD0iaHR0cDov
        L3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zOmVudj0iaHR0cDov
        L3NjaGVtYXMueG1sc29hcC5vcmcvc29hcC9lbnZlbG9wZS8iIHhtbG5zOnhz
        aT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2Ui
        PgogIDxlbnY6SGVhZGVyLz4KICA8ZW52OkJvZHk+CiAgICA8aWRtOlBSUEFf
        SU4yMDEzMDVVVjAyIHhtbG5zOmlkbT0iaHR0cDovL3Zhd3cub2VkLm9pdC52
        YS5nb3YiIHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxT
        Y2hlbWHigJBpbnN0YW5jZSIgeHNpOnNjaGVtYUxvY2F0aW9uPSJ1cm46aGw3
        4oCQb3JnOnYzIC4uLy4uL3NjaGVtYS9ITDdWMy9ORTIwMDgvbXVsdGljYWNo
        ZXNjaGVtYXMvUFJQQV9JTjIwMTMwNVVWMDIueHNkIiB4bWxucz0idXJuOmhs
        N+KAkG9yZzp2MyIgSVRTVmVyc2lvbj0iWE1MXzEuMCI+CiAgICAgIDxpZCBy
        b290PSIxLjIuODQwLjExNDM1MC4xLjEzLjAuMS43LjEuMSIgZXh0ZW5zaW9u
        PSIyMDBWR09WLTMzMTgxNGVkLTFmNzgtNGJmNi05MDg4LWU3NzI5NWM3ZDFl
        YiIvPgogICAgICA8Y3JlYXRpb25UaW1lIHZhbHVlPSIyMDE3MDgxNjIzNTEy
        NCIvPgogICAgICA8dmVyc2lvbkNvZGUgY29kZT0iMy4wIi8+CiAgICAgIDxp
        bnRlcmFjdGlvbklkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjEuNiIgZXh0
        ZW5zaW9uPSJQUlBBX0lOMjAxMzA1VVYwMiIvPgogICAgICA8cHJvY2Vzc2lu
        Z0NvZGUgY29kZT0iVCIvPgogICAgICA8cHJvY2Vzc2luZ01vZGVDb2RlIGNv
        ZGU9IlQiLz4KICAgICAgPGFjY2VwdEFja0NvZGUgY29kZT0iQUwiLz4KICAg
        ICAgPHJlY2VpdmVyIHR5cGVDb2RlPSJSQ1YiPgogICAgICAgIDxkZXZpY2Ug
        Y2xhc3NDb2RlPSJERVYiIGRldGVybWluZXJDb2RlPSJJTlNUQU5DRSI+CiAg
        ICAgICAgICA8aWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy45OTkuMjM0
        IiBleHRlbnNpb249IjIwME0iLz4KICAgICAgICA8L2RldmljZT4KICAgICAg
        PC9yZWNlaXZlcj4KICAgICAgPHNlbmRlciB0eXBlQ29kZT0iU05EIj4KICAg
        ICAgICA8ZGV2aWNlIGNsYXNzQ29kZT0iREVWIiBkZXRlcm1pbmVyQ29kZT0i
        SU5TVEFOQ0UiPgogICAgICAgICAgPGlkIHJvb3Q9IjIuMTYuODQwLjEuMTEz
        ODgzLjQuMzQ5IiBleHRlbnNpb249IjIwMFZHT1YiLz4KICAgICAgICA8L2Rl
        dmljZT4KICAgICAgPC9zZW5kZXI+CiAgICAgIDxjb250cm9sQWN0UHJvY2Vz
        cyBjbGFzc0NvZGU9IkNBQ1QiIG1vb2RDb2RlPSJFVk4iPgogICAgICAgIDxj
        b2RlIGNvZGU9IlBSUEFfVEUyMDEzMDVVVjAyIiBjb2RlU3lzdGVtPSIyLjE2
        Ljg0MC4xLjExMzg4My4xLjYiLz4KICAgICAgICA8cXVlcnlCeVBhcmFtZXRl
        cj4KICAgICAgICAgIDxxdWVyeUlkIHJvb3Q9IjEuMi44NDAuMTE0MzUwLjEu
        MTMuMjguMS4xOC41Ljk5OSIgZXh0ZW5zaW9uPSIxODIwNCIvPgogICAgICAg
        ICAgPHN0YXR1c0NvZGUgY29kZT0ibmV3Ii8+CiAgICAgICAgICA8bW9kaWZ5
        Q29kZSBjb2RlPSJNVkkuQ09NUDEiLz4KICAgICAgICAgIDxpbml0aWFsUXVh
        bnRpdHkgdmFsdWU9IjEiLz4KICAgICAgICAgIDxwYXJhbWV0ZXJMaXN0Pgog
        ICAgICAgICAgICA8aWQgcm9vdD0iMi4xNi44NDAuMS4xMTM4ODMuNC4zNDki
        IGV4dGVuc2lvbj0iaW52YWxpZC1pY24taXMtaGVyZV5OSSIvPgogICAgICAg
        ICAgPC9wYXJhbWV0ZXJMaXN0PgogICAgICAgIDwvcXVlcnlCeVBhcmFtZXRl
        cj4KICAgICAgPC9jb250cm9sQWN0UHJvY2Vzcz4KICAgIDwvaWRtOlBSUEFf
        SU4yMDEzMDVVVjAyPgogIDwvZW52OkJvZHk+CjwvZW52OkVudmVsb3BlPgo=
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - PRPA_IN201305UV02
      Date:
      - Wed, 16 Aug 2017 23:51:24 GMT
      Content-Length:
      - '1889'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 16 Aug 2017 23:50:38 GMT
      Content-Length:
      - '2175'
      Content-Type:
      - text/xml
      Set-Cookie:
      - JSESSIONID=WpfGZJhTv801dB1HF9XhhQKxwyGhgnm2M5RgpSLp1GBcZ2lTspmt!-849143796;
        path=/; HttpOnly
      X-Powered-By:
      - Servlet/2.5 JSP/2.1
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header/><env:Body><idm:PRPA_IN201306UV02
        xmlns="urn:hl7-org:v3" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"><id
        extension="WSDOC1708161850388720248270125" root="2.16.840.1.113883.4.349"/><creationTime
        value="20170816185038"/><versionCode code="3.0"/><interactionId extension="PRPA_IN201306UV02"
        root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode
        code="T"/><acceptAckCode code="NE"/><receiver typeCode="RCV"><device determinerCode="INSTANCE"
        classCode="DEV"><id extension="200VGOV" root="2.16.840.1.113883.4.349"/></device></receiver><sender
        typeCode="SND"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200M"
        root="2.16.840.1.113883.4.349"/></device></sender><acknowledgement><typeCode
        code="AR"/><targetMessage><id extension="200VGOV-331814ed-1f78-4bf6-9088-e77295c7d1eb"
        root="1.2.840.114350.1.13.0.1.7.1.1"/></targetMessage><acknowledgementDetail><code
        codeSystem="2.16.840.1.113883.5.1100" code="INTERR" displayName="Internal
        System Error"/><text>Invalid VPID format</text></acknowledgementDetail><acknowledgementDetail><text>Invalid
        VPID format</text></acknowledgementDetail></acknowledgement><controlActProcess
        classCode="CACT" moodCode="EVN"><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/><queryAck><queryId
        extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><queryResponseCode
        code="AE"/><resultCurrentQuantity value="0"/></queryAck><queryByParameter><queryId
        extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><statusCode code="new"/><modifyCode
        code="MVI.COMP1"/><initialQuantity value="1"/><parameterList><id extension="invalid-icn-is-here^NI"
        root="2.16.840.1.113883.4.349"/></parameterList></queryByParameter></controlActProcess></idm:PRPA_IN201306UV02></env:Body></env:Envelope>
    http_version:
  recorded_at: Wed, 16 Aug 2017 23:51:24 GMT
recorded_with: VCR 3.0.3
